Documents/ПоступлениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПоступлениеОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>InformationRegister.СостояниеОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентомБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьПроводкиПоБалансовымСчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФОСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаводскойНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаЗабалансовый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС13</Name>
					<Comment>(Общ) Ставка НДС 13%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС13_113</Name>
					<Comment>(Общ) Расчетная ставка НДС 13% / 113%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеОС/Ext/ManagerModule.bsl
Функция ПечатьОС14(Ссылка) Экспорт
	
	Макет = ПолучитьОбщийМакет("ОС14");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПоступлениеТоваровУслуг_ОС14";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеОС.Дата КАК ДатаДокумента,
	|	ПоступлениеОС.Номер КАК НомерДокумента,
	|	ПоступлениеОС.Организация КАК ОрганизацияПолучатель,
	|	ПоступлениеОС.Организация.КодПоОКПО КАК ОрганизацияПолучательКодПоОКПО,
	|	ПоступлениеОС.Склад КАК МестоПриема,
	|	ПоступлениеОС.Склад.Представление КАК МестоПриемаНаименование,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	0 КАК СуммаДокумента,
	|	ПоступлениеОС.Контрагент КАК ОрганизацияПоставщик,
	|	ПоступлениеОС.Контрагент КАК ОрганизацияГрузоотправитель,
	|	"""" КАК ОрганизацияПоставщикКодПоОКПО,
	|	"""" КАК Основание,
	|	ПоступлениеОС.НомерВходящегоДокумента КАК ОснованиеНомер,
	|	ПоступлениеОС.ДатаВходящегоДокумента КАК ОснованиеДата,
	|	ПоступлениеОС.ЦФО КАК ПодразделениеОрганизации,
	|	ВЫРАЗИТЬ(ПоступлениеОС.ЦФО.Наименование КАК СТРОКА(200)) КАК ПодразделениеНаименование,
	|	ЛОЖЬ КАК РасчетыВВалюте
	|ИЗ
	|	Документ.ПоступлениеОС КАК ПоступлениеОС
	|ГДЕ
	|	ПоступлениеОС.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	ОрганизацияПолучательНаименование = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияПолучатель, Шапка.ДатаДокумента), "НаименованиеДляПечатныхФорм,");
	ОрганизацияПолучательТелефоны = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияПолучатель, Шапка.ДатаДокумента), "Телефоны,");
	ОрганизацияПолучательБанковскиеРеквизиты = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияПолучатель, Шапка.ДатаДокумента), "НомерСчета,Банк,БИК,КоррСчет,");
	ОрганизацияПоставщикНаименование = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияПоставщик, Шапка.ДатаДокумента), "ПолноеНаименование,");
	ОрганизацияПоставщикТелефоны = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияПоставщик, Шапка.ДатаДокумента), "Телефоны,");
	ОрганизацияПоставщикБанковскиеРеквизиты = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияПоставщик, Шапка.ДатаДокумента), "НомерСчета,Банк,БИК,КоррСчет,");
	ОрганизацияГрузоотправительНаименование = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияГрузоотправитель, Шапка.ДатаДокумента), "НаименованиеДляПечатныхФорм,");
	ОрганизацияГрузоотправительБанковскиеРеквизиты = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
			Шапка.ОрганизацияГрузоотправитель, Шапка.ДатаДокумента), "Телефоны,НомерСчета,Банк,БИК,КоррСчет,");
	
	ОбластьШапка.Параметры.Заполнить(Шапка);
	ОбластьШапка.Параметры.ОрганизацияПолучательНаименование               = ОрганизацияПолучательНаименование;
	ОбластьШапка.Параметры.ОрганизацияПолучательТелефоны                   = ОрганизацияПолучательТелефоны;
	ОбластьШапка.Параметры.ОрганизацияПолучательБанковскиеРеквизиты        = ОрганизацияПолучательБанковскиеРеквизиты;
	ОбластьШапка.Параметры.ОрганизацияПоставщикНаименование                = ОрганизацияПоставщикНаименование;
	ОбластьШапка.Параметры.ОрганизацияПоставщикТелефоны                    = ОрганизацияПоставщикТелефоны;
	ОбластьШапка.Параметры.ОрганизацияПоставщикБанковскиеРеквизиты         = ОрганизацияПоставщикБанковскиеРеквизиты;
	ОбластьШапка.Параметры.ОрганизацияГрузоотправительНаименование         = ОрганизацияГрузоотправительНаименование;
	ОбластьШапка.Параметры.ОрганизацияГрузоотправительБанковскиеРеквизиты  = ОрганизацияГрузоотправительБанковскиеРеквизиты;

	ПодразделениеОтветственныхЛиц = Шапка.ПодразделениеОрганизации;
	
	ОтветственныеЛица = ОбщегоНазначения.ОтветственныеЛица(
		Шапка.ОрганизацияПолучатель, Шапка.ДатаДокумента, ПодразделениеОтветственныхЛиц);

	ОбластьШапка.Параметры.РуководительДолжность    = ОтветственныеЛица.РуководительДолжность;
	ОбластьШапка.Параметры.РуководительНаименование = ОтветственныеЛица.РуководительПредставление;
	ТабДокумент.Вывести(ОбластьШапка);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеОСНоменклатура.Ссылка,
	|	ПоступлениеОСНоменклатура.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеОСНоменклатура.ОсновноеСредство КАК Оборудование,
	|	ВЫРАЗИТЬ(ПоступлениеОСНоменклатура.ОсновноеСредство.Наименование КАК СТРОКА(1000)) КАК ОборудованиеНаименование,
	|	ПоступлениеОСНоменклатура.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	1 КАК Коэффициент,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	1 КАК Количество,
	|	1 КАК ФактическиПринято,
	|	ПоступлениеОСНоменклатура.Сумма КАК СтоимостьЗаЕдиницу,
	|	ПоступлениеОСНоменклатура.Сумма КАК Сумма,
	|	0 КАК СуммаНДС,
	|	ПоступлениеОСНоменклатура.Сумма КАК СуммаВВалютеДокумента,
	|	0 КАК СуммаНДСВВалютеДокумента
	|ИЗ
	|	Документ.ПоступлениеОС.Номенклатура КАК ПоступлениеОСНоменклатура
	|ГДЕ
	|	ПоступлениеОСНоменклатура.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеОСНоменклатура.НомерСтроки";
	ТаблицаПоОборудованию = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОборудование Из ТаблицаПоОборудованию Цикл

		ОбластьСтрока.Параметры.Заполнить(СтрокаОборудование);
		ОбластьСтрока.Параметры.ОборудованиеНаименование = СокрЛП(СтрокаОборудование.ОборудованиеНаименование);
		
		Если Шапка.УчитыватьНДС Тогда
			Если Шапка.СуммаВключаетНДС Тогда
				ОбластьСтрока.Параметры.СтоимостьВсего     = СтрокаОборудование.Сумма - СтрокаОборудование.СуммаНДС;
				ОбластьСтрока.Параметры.СтоимостьЗаЕдиницу = ?(СтрокаОборудование.Количество > 0,
															  (СтрокаОборудование.Сумма - СтрокаОборудование.СуммаНДС) / СтрокаОборудование.Количество,
															   СтрокаОборудование.Сумма - СтрокаОборудование.СуммаНДС);
			Иначе
				ОбластьСтрока.Параметры.СтоимостьВсего     = СтрокаОборудование.Сумма;
				ОбластьСтрока.Параметры.СтоимостьЗаЕдиницу = СтрокаОборудование.СтоимостьЗаЕдиницу;
			КонецЕсли;
		Иначе
			ОбластьСтрока.Параметры.СтоимостьВсего = СтрокаОборудование.Сумма;
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьСтрока);

	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ГлавныйБухгалтерНаименование = ОтветственныеЛица.ГлавныйБухгалтерПредставление;
	ТабДокумент.Вывести(ОбластьМакета);

	ТабДокумент.ПолеСнизу 			= 5;
	ТабДокумент.ПолеСверху 			= 5;	
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.Защита 				= Ложь;
	ТабДокумент.ТолькоПросмотр 		= Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции
